<template>
  <div class="epm-score">
    <HeaderTitle title="设备评分">
      <template #default>
        <span class="title-more" @click="showMore">更多 <DoubleRightOutlined /> </span>
      </template>
    </HeaderTitle>
    <div class="epm-score-content" v-html="scoreContent"></div>
  </div>
</template>

<script lang="ts" setup>
import { DoubleRightOutlined } from "@ant-design/icons-vue";

const showMore = () => {};

const scoreContent = `天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
      天链一号02星，自2011年7月10日发射入轨，在轨时间11年6月，出现在轨故障304次，其中轻微212次，一般88次，严重4次，致命0次，健康状态总体评估堪用。
      剩余燃料45kg，消耗符合预期，预测寿命1年。 太阳电池阵功率1600w，衰减率正常，预测寿命大于1年。
  `;
</script>

<style scoped lang="less">
.epm-score {
  width: 100%;
  grid-column-start: 10;
  grid-column-end: 13;
  grid-row-start: 1;
  grid-row-end: 2;

  &-content {
    height: calc(100% - 50px);
    color: rgba(255, 255, 255, 0.45);
    padding: 20px;
    border: 1px solid #0a84ff80;
    overflow: auto;
  }
}
</style>
